name: "lite_hrnet_model"
platform: "onnxruntime_onnx"

input [
  {
    name: "img"
    data_type: TYPE_FP32
    dims: [ 1, 3, 384, 288 ]
  }
]

output [
  {
    name: "19302"
    data_type: TYPE_FP32
    dims: [ -1, 17, -1, -1 ]
  }
]


instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]