
name: "lite_hrnet_preprocess"
backend: "python"

input [
    {
        name: "image"
        data_type: TYPE_UINT8
        dims: [ 1, -1, -1, 3 ]
    }
]

output [
    {
        name: "preprocessed_image"
        data_type: TYPE_FP32
        dims: [ 1, 3, 384, 288 ]
    },
    {
        name: "orig_shape"
        data_type: TYPE_INT32
        dims: [ 1, 2 ]
    }
]